#+title: Notes To Myself

Notes to myself while designing this project and scheduling TODO entries,
i.e., How To Implement Your Own Shitty Emacs.

*** Example 1: =iso-2022-jp=

I know little about the history behind Emacs. But according to [[http://www.xemacs.org/Documentation/21.5/html/lispref_64.html][XEmacs Lisp
Reference Manual: 63. MULE]] and [[https://flex.phys.tohoku.ac.jp/texi/faq/faq_85.html][Frequently Asked Questions about Emacs - Question
27 (What variants of GNU Emacs exist?)]], MULE comes from Japanese forks of Emacs,
which I do think are some Emacs variants (besides XEmacs) that should be
remembered.

These days, Emacs can handle multilingual text and can (seemingly) losslessly
convert between Unicode and other charsets, even for some charsets not yet
mapped to Unicode. Emacs achieves this by extending the code point range of its
internal UTF-8-like string representation to =0 - #x3FFFFF=: The =0 - #x10FFFF=
range is for Unicode, and the remaining is for lossless storage of
non-convertible characters.

The following example is inspired by [[https://scrapbox.io/shimizukawa/Unicode%E3%81%AB%E3%83%9E%E3%83%83%E3%83%94%E3%83%B3%E3%82%B0%E3%81%95%E3%82%8C%E3%81%A6%E3%81%84%E3%81%AA%E3%81%84%E6%96%87%E5%AD%97][Unicodeにマッピングされていない文字 - 清水
川のScrapbox]] ("Characters that are not yet mapped to Unicode" in English):

#+begin_src elisp :results table
  (let* (;; 洲﨑神社 if the text were convertible to Unicode
         (jis-encoded-bytes  "\x1b$B='yu?@<R\x1b(B")
         ;; Losslessly decoding to Emacs strings
         (lossless-string    (decode-coding-string jis-encoded-bytes 'iso-2022-jp))
         (convertible-char-1 (aref lossless-string 0))
         (non-convertible    (aref lossless-string 1))
         (re-encoded-bytes   (encode-coding-string lossless-string 'iso-2022-jp)))
    `(("Converted string"
       ;; Replace non-Unicode chars so that the outputs won't disrupt the coding of this file.
       ;; It did corrupted the encoding last time...
       ,(replace-regexp-in-string "[^\0-\U0010FFFF]" "?" lossless-string))
      ("Original bytes" ,(prin1-to-string jis-encoded-bytes))
      ("Re-encoded bytes" ,(prin1-to-string re-encoded-bytes))
      ("Convertible char" ,(format "%c (#x%06x < #x10FFFF)" convertible-char-1 convertible-char-1))
      ("Non-convertible"  ,(format "__ (#x%06x > #x10FFFF)" non-convertible))))
#+end_src

#+RESULTS:
| Converted string | 洲?神社                  |
| Original bytes   | "$B='yu?@<R(B"       |
| Re-encoded bytes | "$B='yu?@<R(B"       |
| Convertible char | 洲 (#x006d32 < #x10FFFF) |
| Non-convertible  | __ (#x1420a4 > #x10FFFF) |

*** Example 2: =lisp/language/ethiopic.el=

So awhile ago I started bootstraping files from =emacs/lisp/language/*.el=,
and... there you go. Another example right in the source code:

#+begin_src elisp
  (let ((non-unicode (with-temp-buffer
                       (insert-file (locate-file "ethiopic.el" load-path))
                       (replace-regexp "[\0-\U0010FFFF]+" "")
                       (buffer-string))))
    (format "#x%X > #x10FFFF" (aref non-unicode 0)))
#+end_src

#+RESULTS:
: #x1A01CA > #x10FFFF

There are some more files similar to =ethiopic.el=:

#+begin_src elisp
  (defun file-contains-non-unicode? (file)
    (with-temp-buffer
      (insert-file file)
      (search-forward-regexp "[^\0-\U0010FFFF]" nil t)))

  (let* ((language-dir (file-name-parent-directory (locate-file "ethiopic.el" load-path)))
         (files (append (directory-files language-dir t ".*\\.el$")
                        (directory-files (file-name-concat (file-name-parent-directory language-dir)
                                                           "international")
                                         t ".*\\.el$")))
         non-unicode-files)
    (dolist (file files)
      (if (file-contains-non-unicode? file)
          (push (list (file-name-nondirectory file)) non-unicode-files)))
    non-unicode-files)
#+end_src

#+RESULTS:
| titdic-cnv.el |
| tibetan.el    |
| tibet-util.el |
| ind-util.el   |
| ethiopic.el   |
| ethio-util.el |

